# IntegerParameterValue Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IntegerParameterValue Class
Members See Also
---
A class that holds an Integer value of a parameter element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016 Subscription Update
# Syntax
C#
---
```text
public class IntegerParameterValue : ParameterValue
```

Visual Basic
---
```text
Public Class IntegerParameterValue _
	Inherits ParameterValue
```

Visual C++
---
```text
public ref class IntegerParameterValue : public ParameterValue
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ParameterValue Autodesk.Revit.DB..::..IntegerParameterValue
# See Also
IntegerParameterValue Members
Autodesk.Revit.DB Namespace